ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.h
/***************************************************************************//**
* \file cy_ble_cps.h
* \version 2.0
*
* \brief
*  Contains the function prototypes and constants for Cycling Power Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef CY_BLE_CPS_H
#define CY_BLE_CPS_H

#include "cy_ble_gatt.h"

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_CPS))

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/***************************************
* Data Types
***************************************/

/**
 * \addtogroup group_ble_service_api_CPS_definitions
 * @{
 */

/** Characteristic indexes */
typedef enum
{
    CY_BLE_CPS_POWER_MEASURE,       /**< Cycling Power Measurement characteristic index */
    CY_BLE_CPS_POWER_FEATURE,       /**< Cycling Power Feature characteristic index */
    CY_BLE_CPS_SENSOR_LOCATION,     /**< Sensor Location characteristic index */
    CY_BLE_CPS_POWER_VECTOR,        /**< Cycling Power Vector characteristic index */
    CY_BLE_CPS_POWER_CP,            /**< Cycling Power Control Point characteristic index */
    CY_BLE_CPS_CHAR_COUNT           /**< Total count of CPS characteristics */
}cy_en_ble_cps_char_index_t;

/** Characteristic Descriptors indexes */
typedef enum
{
    CY_BLE_CPS_CCCD,                /**< Client Characteristic Configuration descriptor index */
    CY_BLE_CPS_SCCD,                /**< Handle of the Server Characteristic Configuration descriptor */
    CY_BLE_CPS_DESCR_COUNT          /**< Total count of descriptors */
}cy_en_ble_cps_descr_index_t;

/** Characteristic with descriptors */
typedef struct
{
    cy_ble_gatt_db_attr_handle_t charHandle;                          /**< Handle of characteristic value */
    cy_ble_gatt_db_attr_handle_t descrHandle[CY_BLE_CPS_DESCR_COUNT]; /**< Handle of descriptor */
} cy_stc_ble_cpss_char_t;

/** Structure with Cycling Power Service attribute handles */
typedef struct
{
    /** Cycling Power Service handle */
    cy_ble_gatt_db_attr_handle_t serviceHandle;

    /** Cycling Power Service Characteristic handles */
    cy_stc_ble_cpss_char_t       charInfo[CY_BLE_CPS_CHAR_COUNT];
} cy_stc_ble_cpss_t;

/** Characteristic with descriptors */
typedef struct
{
    cy_ble_gatt_db_attr_handle_t descrHandle[CY_BLE_CPS_DESCR_COUNT];   /**< Handles of descriptors */
    cy_ble_gatt_db_attr_handle_t valueHandle;                           /**< Handle of characteristic value */
    cy_ble_gatt_db_attr_handle_t endHandle;                             /**< End handle of characteristic */
    uint8_t                      properties;                            /**< Properties for value field */
} cy_stc_ble_cpsc_char_t;

/** Structure with discovered attributes information of Cycling Power Service */
typedef struct
{
    /** Characteristic handles array */
    cy_stc_ble_cpsc_char_t charInfo[CY_BLE_CPS_CHAR_COUNT];
} cy_stc_ble_cpsc_t;

/** Characteristic value parameter structure of Cycling Power Service */
typedef struct
{
    /** Peer device handle */
    cy_stc_ble_conn_handle_t connHandle;

    /** bd address type of the device advertising.
     *  - CY_BLE_GAP_ADDR_TYPE_PUBLIC
     *  - CY_BLE_GAP_ADDR_TYPE_RANDOM
     *  - CY_BLE_GAP_ADDR_TYPE_PUBLIC_RPA
     *  - CY_BLE_GAP_ADDR_TYPE_RANDOM_RPA
     */
    uint8_t peerAddrType;

    /** Public Device Address or Random Device Address for
     * each device that responded to scanning. */
    uint8_t                    *peerBdAddr;

    /** Index of service characteristic */
    cy_en_ble_cps_char_index_t charIndex;

    /** Characteristic value */
    cy_stc_ble_gatt_value_t    *value;
} cy_stc_ble_cps_char_value_t;

/** Characteristic Descriptor Value parameter structure of Cycling Power Service */
typedef struct
{
    cy_stc_ble_conn_handle_t    connHandle;           /**< Peer device handle */
    cy_en_ble_cps_char_index_t  charIndex;            /**< Index of service characteristic */
    cy_en_ble_cps_descr_index_t descrIndex;           /**< Index of descriptor */
    cy_stc_ble_gatt_value_t     *value;               /**< Characteristic value */
} cy_stc_ble_cps_descr_value_t;

/** Date/time structure of Cycling Power Service */
typedef struct
{
    uint16_t year;                                    /**< Year */
    uint8_t  month;                                   /**< Month */
    uint8_t  day;                                     /**< Day */
    uint8_t  hours;                                   /**< Time - hours */
    uint8_t  minutes;                                 /**< Time - minutes */
    uint8_t  seconds;                                 /**< Time - seconds */
}__PACKED cy_stc_ble_cps_date_time_t;

/** Adjustment structure of Cycling Power Service */
typedef struct
{
    uint16_t                   crankLength;            /**< In millimeters with a resolution of 1/2 millimeter */
    uint16_t                   chainLength;            /**< In millimeters with a resolution of 1 millimeter */
    uint16_t                   chainWeight;            /**< In grams with a resolution of 1 gram */
    uint16_t                   spanLength;             /**< In millimeters with a resolution of 1 millimeter */
    cy_stc_ble_cps_date_time_t factoryCalibrationDate; /**< Use the same format as the Date Time characteristic */
    uint8_t                    samplingRate;           /**< In Hertz with a resolution of 1 Hertz */
    int16_t                    offsetCompensation;     /**< Either the raw force in Newton or the raw torque in 1/32
                                                        *    Newton meter based on the server capabilities.
                                                        *    0xFFFF means "Not Available" */
}__PACKED cy_stc_ble_cps_cp_adjustment_t;

/** Service configuration structure */
typedef struct
{
    /** Cycling Power Service GATT DB handles structure */
    const cy_stc_ble_cpss_t *cpss;

    /** An application layer event callback function to receive service events from the BLE Component. */
    cy_ble_callback_t       callbackFunc;
} cy_stc_ble_cps_config_t;

/** @} */


