ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.h
#define CY_BLE_CPSS_BROADCAST_DATA_LEN_MIN              (0x07u)
#define CY_BLE_CPSS_BROADCAST_DATA_HEADER_LEN           (0x03u)
#define CY_BLE_CPSS_BROADCAST_PACKETS                   (0x03u)
#define CY_BLE_CPSS_BROADCAST_HEADER_LEN                (CY_BLE_GAP_ADV_FLAGS_PACKET_LENGTH +           \
                                                         CY_BLE_GAP_ADV_ADVERT_INTERVAL_PACKET_LENGTH + \
                                                         CY_BLE_CPSS_BROADCAST_DATA_HEADER_LEN +        \
                                                         CY_BLE_CPSS_BROADCAST_PACKETS)

#define CY_BLE_CPSC_BROADCAST_DATA_OFFSET               (0x04u)


/* Function Prototypes */

/** \addtogroup group_ble_service_api_CPS_server_client
 * @{
 */

cy_en_ble_api_result_t Cy_BLE_CPS_Init(cy_stc_ble_cps_config_t *config);
cy_en_ble_api_result_t Cy_BLE_CPS_RegisterAttrCallback(cy_ble_callback_t callbackFunc);

/** @} */

#ifdef CY_BLE_CPS_SERVER
/**
 * \addtogroup group_ble_service_api_CPS_server
 * @{
 */

cy_en_ble_api_result_t Cy_BLE_CPSS_SetCharacteristicValue(cy_en_ble_cps_char_index_t charIndex, uint8_t attrSize,
                                                          uint8_t *attrValue);

cy_en_ble_api_result_t Cy_BLE_CPSS_GetCharacteristicValue(cy_en_ble_cps_char_index_t charIndex, uint8_t attrSize,
                                                          uint8_t *attrValue);

cy_en_ble_api_result_t Cy_BLE_CPSS_SetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_cps_char_index_t charIndex,
                                                               cy_en_ble_cps_descr_index_t descrIndex,
                                                               uint8_t attrSize, uint8_t *attrValue);

cy_en_ble_api_result_t Cy_BLE_CPSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_cps_char_index_t charIndex,
                                                               cy_en_ble_cps_descr_index_t descrIndex,
                                                               uint8_t attrSize, uint8_t *attrValue);

cy_en_ble_api_result_t Cy_BLE_CPSS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                    cy_en_ble_cps_char_index_t charIndex, uint8_t attrSize,
                                                    uint8_t *attrValue);

cy_en_ble_api_result_t Cy_BLE_CPSS_SendIndication(cy_stc_ble_conn_handle_t connHandle,
                                                  cy_en_ble_cps_char_index_t charIndex, uint8_t attrSize,
                                                  uint8_t *attrValue);

#if CY_BLE_GAP_ROLE_BROADCASTER
cy_en_ble_api_result_t Cy_BLE_CPSS_StartBroadcast(uint16_t advInterval, uint8_t attrSize, const uint8_t *attrValue);
cy_en_ble_api_result_t Cy_BLE_CPSS_StopBroadcast(void);
/** @} */
#endif /* CY_BLE_GAP_ROLE_BROADCASTER */

#endif /* CY_BLE_CPS_SERVER */

#ifdef CY_BLE_CPS_CLIENT
/**
 * \addtogroup group_ble_service_api_CPS_client
 * @{
 */

cy_en_ble_api_result_t Cy_BLE_CPSC_SetCharacteristicValue(cy_stc_ble_conn_handle_t connHandle,
                                                          cy_en_ble_cps_char_index_t charIndex, uint8_t attrSize,
                                                          uint8_t *attrValue);

cy_en_ble_api_result_t Cy_BLE_CPSC_GetCharacteristicValue(cy_stc_ble_conn_handle_t connHandle,
                                                          cy_en_ble_cps_char_index_t charIndex);

cy_en_ble_api_result_t Cy_BLE_CPSC_SetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_cps_char_index_t charIndex,
                                                               cy_en_ble_cps_descr_index_t
                                                               descrIndex, uint8_t attrSize, uint8_t *attrValue);

cy_en_ble_api_result_t Cy_BLE_CPSC_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_cps_char_index_t charIndex,
                                                               cy_en_ble_cps_descr_index_t
                                                               descrIndex);

cy_en_ble_api_result_t Cy_BLE_CPSC_StartObserve(uint8_t scanParamIndex);

cy_en_ble_api_result_t Cy_BLE_CPSC_StopObserve(void);

/** @} */
#endif /* (CY_BLE_CPS_CLIENT) */


/* ##Private Function Prototypes
** \cond IGNORE
*/
void Cy_BLE_CPSS_Init(void);
#ifdef CY_BLE_CPS_SERVER
#define Cy_BLE_CPSS_ConnectEventHandler       Cy_BLE_CPSS_Init
#define Cy_BLE_CPSS_DisconnectEventHandler    Cy_BLE_CPSS_StopBroadcast
#endif /* CY_BLE_CPS_SERVER */

#ifdef CY_BLE_CPS_CLIENT
#define Cy_BLE_CPSC_DisconnectEventHandler    Cy_BLE_CPSC_StopObserve
#endif /* (CY_BLE_CPS_CLIENT) */
/** \endcond */

/* ##Macro Functions */

#ifdef CY_BLE_CPS_CLIENT

#define Cy_BLE_CPSC_CheckCharHandle(handle)                                  \
    do {                                                                     \
        if((handle).valueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)    \
        {                                                                    \
            (handle).valueHandle = discCharInfo->valueHandle;                \
            (handle).properties = discCharInfo->properties;                  \
        }                                                                    \
        else                                                                 \
        {                                                                    \
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DUPLICATION, \
                                &(discCharInfo));                            \
        }                                                                    \
    } while(0)

