ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.h
#define Cy_BLE_CPSC_GetCharacteristicValueHandle(connHandle, charIndex) \
    (((charIndex) >= CY_BLE_CPS_CHAR_COUNT) ?                           \
     CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE :                            \
     cy_ble_cpsc[Cy_BLE_GetDiscoveryIdx(connHandle)].charInfo[charIndex].valueHandle)

#define Cy_BLE_CPSC_GetCharacteristicDescriptorHandle(connHandle, charIndex, descrIndex)    \
    ((((charIndex) >= CY_BLE_CPS_CHAR_COUNT) || ((descrIndex) >= CY_BLE_CPS_DESCR_COUNT)) ? \
     CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE :                                                \
     cy_ble_cpsc[Cy_BLE_GetDiscoveryIdx(connHandle)].charInfo[charIndex].descrHandle[descrIndex])

#endif /* (CY_BLE_CPS_CLIENT) */


/* ##External data references */

#ifdef CY_BLE_CPS_SERVER
extern cy_stc_ble_gapp_disc_mode_info_t cy_ble_cpssBroadcastModeInfo;
extern cy_stc_ble_cps_cp_adjustment_t cy_ble_cpssAdjustment;
#endif /* CY_BLE_CPS_SERVER */

#ifdef CY_BLE_CPS_CLIENT
extern cy_stc_ble_cpsc_t cy_ble_cpsc[CY_BLE_CONFIG_GATTC_COUNT];
#endif /* (CY_BLE_CPS_CLIENT) */

#ifdef CY_BLE_GAP_ROLE_BROADCASTER
extern cy_stc_ble_gapp_disc_param_t cy_ble_cpssBroadcastParam;
extern cy_stc_ble_gapp_disc_data_t cy_ble_cpssBroadcastData;
#endif /* (CY_BLE_GAP_ROLE_BROADCASTER) */

extern cy_stc_ble_cps_config_t cy_ble_cpsConfig;
extern cy_stc_ble_cps_config_t *cy_ble_cpsConfigPtr;

#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* CY_BLE_MODE_PROFILE && defined(CY_BLE_CPS) */
#endif /* CY_BLE_CPS_H */


/* [] END OF FILE */
